In [8]:
import pandas as pd
import numpy as np

In [2]:
s1=pd.Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])

In [3]:
s2=pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
            index=['a','c','e','f','g'])

In [4]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [5]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [6]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [9]:
df1=pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'),
                index=['Ohio','Texas','Colorado'])

In [10]:
df2=pd.DataFrame(np.arange(12.).reshape(4,3), columns=list('bde'),
                index=['Utah','Ohio','Texas','Oregon'])

In [11]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [12]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [13]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [14]:
df1-df2

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio     -3.0 NaN -2.0 NaN
Oregon    NaN NaN  NaN NaN
Texas    -3.0 NaN -2.0 NaN
Utah      NaN NaN  NaN NaN

In [15]:
df2-df1

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio      3.0 NaN  2.0 NaN
Oregon    NaN NaN  NaN NaN
Texas     3.0 NaN  2.0 NaN
Utah      NaN NaN  NaN NaN

In [16]:
df3=pd.DataFrame({'A':[1,2]})

In [17]:
df4=pd.DataFrame({'B':[3,4]})

In [18]:
df3-df4

    A   B
0 NaN NaN
1 NaN NaN